app/controllers/project_controller.rb

  def create
    Project.create(params[:project])
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "repository_url", "description") VALUES('Projeto Mezuro', '2010-03-19 14:37:59', '2010-03-19 14:37:59', 'git://github.com/paulormm/mezuro.git', 'Projeto para visualização de métricas')