app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at", "personal_webpage", "repository_url", "description", "identifier") VALUES('Mezuro Project', '2010-03-26 18:08:31', '2010-03-26 18:08:31', NULL, 'git://github.com/paulormm/mezuro.git', NULL, 'identifier')
---
  def create
    @project  = Project.new(params[:project])
    if @project.save

SELECT * FROM "projects" WHERE ("projects"."identifier" = 'mezuro') LIMIT 1
---
  def show
    @project = Project.find_by_identifier params[:identifier]